title: Mimikatz or known credential dump tools
id: sigma-025
status: experimental
description: |
  Sigma rule to detect: Mimikatz or known credential dump tools
references:
author: adam.ring
date: 2025-07-31
tags:
- attack.tactic.credential-access
- attack.technique.T1003.001
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        query: |
          DeviceProcessEvents
          | where ProcessCommandLine has_any ("sekurlsa", "mimikatz", "privilege::debug", "logonpasswords")
    condition: selection
falsepositives:
level: high
