title: DNS Enumeration via command-line tools
id: sigma-001
status: experimental
description: |
  Sigma rule to detect: DNS Enumeration via command-line tools
references:

author: adam.ring
date: 2025-07-31
tags:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        query: |
          DeviceProcessEvents
          | where FileName in~ ("nslookup.exe", "whois.exe", "dig.exe")
          | project TimeGenerated, DeviceName, AccountName, FileName, ProcessCommandLine
    condition: selection
falsepositives:

level: high
