title: Compression of sensitive folders
id: sigma-028
status: experimental
description: |
  Sigma rule to detect: Compression of sensitive folders
references:

author: adam.ring
date: 2025-07-31
tags:

logsource:
    category: process_creation
    product: windows
detection:
    selection:
        query: |
          DeviceProcessEvents
          | where ProcessCommandLine has_any (".zip", ".rar", "Compress-Archive")
          | where ProcessCommandLine has_any ("C:\\Users", "Documents", "Desktop")
    condition: selection
falsepositives:

level: high
