title: Beacon-like network behavior
id: sigma-023
status: experimental
description: |
  Sigma rule to detect: Beacon-like network behavior
references:
author: adam.ring
date: 2025-07-31
tags:
- attack.tactic.command-and-control
- attack.technique.T1071
logsource:
    category: network_connection
    product: windows
detection:
    selection:
        query: |
          DeviceNetworkEvents
          | summarize Connections = count(), FirstSeen=min(TimeGenerated), LastSeen=max(TimeGenerated) by DeviceName, RemoteIP, RemotePort, InitiatingProcessFileName
          | extend DurationInMin = datetime_diff("minute", LastSeen, FirstSeen)
          | where DurationInMin > 30 and Connections > 100
    condition: selection
falsepositives:
level: high
